# Handling missing value

In [77]:
import pandas

In [78]:
null = pandas.read_csv('../input/null-and-replace/NULL and replace.csv')

In [79]:
null.head()

   month  book1  b1-value  book2  b2-value  book3  b3-value  income
0    jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1    feb   50.0       NaN    3.0       NaN   20.0       NaN   480.0
2  march   30.0       NaN    1.0       NaN   10.0       NaN   200.0
3  apiri   20.0       NaN    0.0       NaN    5.0       NaN    60.0
4    may   10.0       NaN    0.0       NaN    1.0       NaN    24.0

### fillna()
The fillna() function is used to fill NA/NaN values using the specified method. Value to use to fill holes (e.g. 0), alternately a dict/Series/DataFrame of values specifying which value to use for each index (for a Series) or column (for a DataFrame)

In [80]:
null.fillna(0)

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       0.0    3.0       0.0   20.0       0.0   480.0
2    march   30.0       0.0    1.0       0.0   10.0       0.0   200.0
3    apiri   20.0       0.0    0.0       0.0    5.0       0.0    60.0
4      may   10.0       0.0    0.0       0.0    1.0       0.0    24.0
5      jun   40.0       0.0    0.0       0.0   20.0       0.0   160.0
6     july   50.0       0.0    0.0       0.0   30.0       0.0   220.0
7   aguage   90.0       0.0    5.0       0.0   40.0       0.0   840.0
8      sem    0.0       0.0    0.0       0.0    0.0       0.0    10.0
9      oct   10.0       0.0    0.0       0.0    1.0       0.0    24.0
10     nov   40.0       0.0    2.0       0.0   10.0       0.0   240.0
11     dec   20.0       0.0    0.0       0.0    2.0       0.0   100.0
12    njan    0.0       0.0    0.0       0.0    0.0       0.0   500.0
13    nfeb    0.0       0.0    0.0       0.0    0.0       0.0   380.0
14  nmarch    0.0       0.0    0.0       0.0    0.0       0.0   100.0
15       0    0.0       0.0    0.0       0.0    0.0       0.0     0.0
16    nmay   50.0       0.0    0.0       0.0   30.0       0.0   220.0

In [81]:
null.fillna({
    'b1-value':3,
    'b2-value':200,
    'b3-value':5,
})

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       3.0    3.0     200.0   20.0       5.0   480.0
2    march   30.0       3.0    1.0     200.0   10.0       5.0   200.0
3    apiri   20.0       3.0    0.0     200.0    5.0       5.0    60.0
4      may   10.0       3.0    0.0     200.0    1.0       5.0    24.0
5      jun   40.0       3.0    0.0     200.0   20.0       5.0   160.0
6     july   50.0       3.0    0.0     200.0   30.0       5.0   220.0
7   aguage   90.0       3.0    5.0     200.0   40.0       5.0   840.0
8      sem    NaN       3.0    NaN     200.0    NaN       5.0    10.0
9      oct   10.0       3.0    0.0     200.0    1.0       5.0    24.0
10     nov   40.0       3.0    2.0     200.0   10.0       5.0   240.0
11     dec   20.0       3.0    0.0     200.0    2.0       5.0   100.0
12    njan    NaN       3.0    NaN     200.0    NaN       5.0   500.0
13    nfeb    NaN       3.0    NaN     200.0    NaN       5.0   380.0
14  nmarch    NaN       3.0    NaN     200.0    NaN       5.0   100.0
15     NaN    NaN       3.0    NaN     200.0    NaN       5.0     NaN
16    nmay   50.0       3.0    0.0     200.0   30.0       5.0   220.0

In [82]:
null.fillna(method = "ffill")

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       2.0    3.0     100.0   20.0       4.0   480.0
2    march   30.0       2.0    1.0     100.0   10.0       4.0   200.0
3    apiri   20.0       2.0    0.0     100.0    5.0       4.0    60.0
4      may   10.0       2.0    0.0     100.0    1.0       4.0    24.0
5      jun   40.0       2.0    0.0     100.0   20.0       4.0   160.0
6     july   50.0       2.0    0.0     100.0   30.0       4.0   220.0
7   aguage   90.0       2.0    5.0     100.0   40.0       4.0   840.0
8      sem   90.0       2.0    5.0     100.0   40.0       4.0    10.0
9      oct   10.0       2.0    0.0     100.0    1.0       4.0    24.0
10     nov   40.0       2.0    2.0     100.0   10.0       4.0   240.0
11     dec   20.0       2.0    0.0     100.0    2.0       4.0   100.0
12    njan   20.0       2.0    0.0     100.0    2.0       4.0   500.0
13    nfeb   20.0       2.0    0.0     100.0    2.0       4.0   380.0
14  nmarch   20.0       2.0    0.0     100.0    2.0       4.0   100.0
15  nmarch   20.0       2.0    0.0     100.0    2.0       4.0   100.0
16    nmay   50.0       2.0    0.0     100.0   30.0       4.0   220.0

In [83]:
null.fillna(method = "bfill")

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       NaN    3.0       NaN   20.0       NaN   480.0
2    march   30.0       NaN    1.0       NaN   10.0       NaN   200.0
3    apiri   20.0       NaN    0.0       NaN    5.0       NaN    60.0
4      may   10.0       NaN    0.0       NaN    1.0       NaN    24.0
5      jun   40.0       NaN    0.0       NaN   20.0       NaN   160.0
6     july   50.0       NaN    0.0       NaN   30.0       NaN   220.0
7   aguage   90.0       NaN    5.0       NaN   40.0       NaN   840.0
8      sem   10.0       NaN    0.0       NaN    1.0       NaN    10.0
9      oct   10.0       NaN    0.0       NaN    1.0       NaN    24.0
10     nov   40.0       NaN    2.0       NaN   10.0       NaN   240.0
11     dec   20.0       NaN    0.0       NaN    2.0       NaN   100.0
12    njan   50.0       NaN    0.0       NaN   30.0       NaN   500.0
13    nfeb   50.0       NaN    0.0       NaN   30.0       NaN   380.0
14  nmarch   50.0       NaN    0.0       NaN   30.0       NaN   100.0
15    nmay   50.0       NaN    0.0       NaN   30.0       NaN   220.0
16    nmay   50.0       NaN    0.0       NaN   30.0       NaN   220.0

In [84]:
null.fillna(method = "bfill",axis ="columns")

     month book1 b1-value book2 b2-value book3 b3-value income
0      jan   100        2     2      100    50        4    600
1      feb    50        3     3       20    20      480    480
2    march    30        1     1       10    10      200    200
3    apiri    20        0     0        5     5       60     60
4      may    10        0     0        1     1       24     24
5      jun    40        0     0       20    20      160    160
6     july    50        0     0       30    30      220    220
7   aguage    90        5     5       40    40      840    840
8      sem    10       10    10       10    10       10     10
9      oct    10        0     0        1     1       24     24
10     nov    40        2     2       10    10      240    240
11     dec    20        0     0        2     2      100    100
12    njan   500      500   500      500   500      500    500
13    nfeb   380      380   380      380   380      380    380
14  nmarch   100      100   100      100   100      100    100
15     NaN   NaN      NaN   NaN      NaN   NaN      NaN    NaN
16    nmay    50        0     0       30    30      220    220

In [85]:
null.fillna(method = "ffill",axis ="columns")

     month   book1 b1-value   book2 b2-value   book3 b3-value income
0      jan     100        2       2      100      50        4    600
1      feb      50       50       3        3      20       20    480
2    march      30       30       1        1      10       10    200
3    apiri      20       20       0        0       5        5     60
4      may      10       10       0        0       1        1     24
5      jun      40       40       0        0      20       20    160
6     july      50       50       0        0      30       30    220
7   aguage      90       90       5        5      40       40    840
8      sem     sem      sem     sem      sem     sem      sem     10
9      oct      10       10       0        0       1        1     24
10     nov      40       40       2        2      10       10    240
11     dec      20       20       0        0       2        2    100
12    njan    njan     njan    njan     njan    njan     njan    500
13    nfeb    nfeb     nfeb    nfeb     nfeb    nfeb     nfeb    380
14  nmarch  nmarch   nmarch  nmarch   nmarch  nmarch   nmarch    100
15     NaN     NaN      NaN     NaN      NaN     NaN      NaN    NaN
16    nmay      50       50       0        0      30       30    220

In [86]:
null.fillna(method = "ffill",axis ="rows",limit = 1)

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       2.0    3.0     100.0   20.0       4.0   480.0
2    march   30.0       NaN    1.0       NaN   10.0       NaN   200.0
3    apiri   20.0       NaN    0.0       NaN    5.0       NaN    60.0
4      may   10.0       NaN    0.0       NaN    1.0       NaN    24.0
5      jun   40.0       NaN    0.0       NaN   20.0       NaN   160.0
6     july   50.0       NaN    0.0       NaN   30.0       NaN   220.0
7   aguage   90.0       NaN    5.0       NaN   40.0       NaN   840.0
8      sem   90.0       NaN    5.0       NaN   40.0       NaN    10.0
9      oct   10.0       NaN    0.0       NaN    1.0       NaN    24.0
10     nov   40.0       NaN    2.0       NaN   10.0       NaN   240.0
11     dec   20.0       NaN    0.0       NaN    2.0       NaN   100.0
12    njan   20.0       NaN    0.0       NaN    2.0       NaN   500.0
13    nfeb    NaN       NaN    NaN       NaN    NaN       NaN   380.0
14  nmarch    NaN       NaN    NaN       NaN    NaN       NaN   100.0
15  nmarch    NaN       NaN    NaN       NaN    NaN       NaN   100.0
16    nmay   50.0       NaN    0.0       NaN   30.0       NaN   220.0

### interpolate()
interpolate is a convenient method to create a function based on fixed data points, which can be evaluated anywhere within the domain defined by the given data using linear interpolation. By using the above data, let us create a interpolate function and draw a new interpolated graph.

In [87]:
null.interpolate()

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       2.0    3.0     100.0   20.0       4.0   480.0
2    march   30.0       2.0    1.0     100.0   10.0       4.0   200.0
3    apiri   20.0       2.0    0.0     100.0    5.0       4.0    60.0
4      may   10.0       2.0    0.0     100.0    1.0       4.0    24.0
5      jun   40.0       2.0    0.0     100.0   20.0       4.0   160.0
6     july   50.0       2.0    0.0     100.0   30.0       4.0   220.0
7   aguage   90.0       2.0    5.0     100.0   40.0       4.0   840.0
8      sem   50.0       2.0    2.5     100.0   20.5       4.0    10.0
9      oct   10.0       2.0    0.0     100.0    1.0       4.0    24.0
10     nov   40.0       2.0    2.0     100.0   10.0       4.0   240.0
11     dec   20.0       2.0    0.0     100.0    2.0       4.0   100.0
12    njan   26.0       2.0    0.0     100.0    7.6       4.0   500.0
13    nfeb   32.0       2.0    0.0     100.0   13.2       4.0   380.0
14  nmarch   38.0       2.0    0.0     100.0   18.8       4.0   100.0
15     NaN   44.0       2.0    0.0     100.0   24.4       4.0   160.0
16    nmay   50.0       2.0    0.0     100.0   30.0       4.0   220.0

In [88]:
null.dropna()

  month  book1  b1-value  book2  b2-value  book3  b3-value  income
0   jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0

In [89]:
null.dropna(how="all")

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       NaN    3.0       NaN   20.0       NaN   480.0
2    march   30.0       NaN    1.0       NaN   10.0       NaN   200.0
3    apiri   20.0       NaN    0.0       NaN    5.0       NaN    60.0
4      may   10.0       NaN    0.0       NaN    1.0       NaN    24.0
5      jun   40.0       NaN    0.0       NaN   20.0       NaN   160.0
6     july   50.0       NaN    0.0       NaN   30.0       NaN   220.0
7   aguage   90.0       NaN    5.0       NaN   40.0       NaN   840.0
8      sem    NaN       NaN    NaN       NaN    NaN       NaN    10.0
9      oct   10.0       NaN    0.0       NaN    1.0       NaN    24.0
10     nov   40.0       NaN    2.0       NaN   10.0       NaN   240.0
11     dec   20.0       NaN    0.0       NaN    2.0       NaN   100.0
12    njan    NaN       NaN    NaN       NaN    NaN       NaN   500.0
13    nfeb    NaN       NaN    NaN       NaN    NaN       NaN   380.0
14  nmarch    NaN       NaN    NaN       NaN    NaN       NaN   100.0
16    nmay   50.0       NaN    0.0       NaN   30.0       NaN   220.0

In [90]:
null.dropna(thresh=3)

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       NaN    3.0       NaN   20.0       NaN   480.0
2    march   30.0       NaN    1.0       NaN   10.0       NaN   200.0
3    apiri   20.0       NaN    0.0       NaN    5.0       NaN    60.0
4      may   10.0       NaN    0.0       NaN    1.0       NaN    24.0
5      jun   40.0       NaN    0.0       NaN   20.0       NaN   160.0
6     july   50.0       NaN    0.0       NaN   30.0       NaN   220.0
7   aguage   90.0       NaN    5.0       NaN   40.0       NaN   840.0
9      oct   10.0       NaN    0.0       NaN    1.0       NaN    24.0
10     nov   40.0       NaN    2.0       NaN   10.0       NaN   240.0
11     dec   20.0       NaN    0.0       NaN    2.0       NaN   100.0
16    nmay   50.0       NaN    0.0       NaN   30.0       NaN   220.0

### replace() 
It is an inbuilt function in Python programming language that returns a copy of the string where all occurrences of a substring is replaced with another substring.

In [91]:
null.replace(['jan','feb','march','apiri','may','jun','july','aguage','sem','oct','nov','dec'],[1,2,3,4,5,6,7,8,9,10,11,12])

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0        1  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1        2   50.0       NaN    3.0       NaN   20.0       NaN   480.0
2        3   30.0       NaN    1.0       NaN   10.0       NaN   200.0
3        4   20.0       NaN    0.0       NaN    5.0       NaN    60.0
4        5   10.0       NaN    0.0       NaN    1.0       NaN    24.0
5        6   40.0       NaN    0.0       NaN   20.0       NaN   160.0
6        7   50.0       NaN    0.0       NaN   30.0       NaN   220.0
7        8   90.0       NaN    5.0       NaN   40.0       NaN   840.0
8        9    NaN       NaN    NaN       NaN    NaN       NaN    10.0
9       10   10.0       NaN    0.0       NaN    1.0       NaN    24.0
10      11   40.0       NaN    2.0       NaN   10.0       NaN   240.0
11      12   20.0       NaN    0.0       NaN    2.0       NaN   100.0
12    njan    NaN       NaN    NaN       NaN    NaN       NaN   500.0
13    nfeb    NaN       NaN    NaN       NaN    NaN       NaN   380.0
14  nmarch    NaN       NaN    NaN       NaN    NaN       NaN   100.0
15     NaN    NaN       NaN    NaN       NaN    NaN       NaN     NaN
16    nmay   50.0       NaN    0.0       NaN   30.0       NaN   220.0

In [92]:
df = null.fillna(method = "ffill")
df.loc[15,'month'] = 'napiri'

In [93]:
df

     month  book1  b1-value  book2  b2-value  book3  b3-value  income
0      jan  100.0       2.0    2.0     100.0   50.0       4.0   600.0
1      feb   50.0       2.0    3.0     100.0   20.0       4.0   480.0
2    march   30.0       2.0    1.0     100.0   10.0       4.0   200.0
3    apiri   20.0       2.0    0.0     100.0    5.0       4.0    60.0
4      may   10.0       2.0    0.0     100.0    1.0       4.0    24.0
5      jun   40.0       2.0    0.0     100.0   20.0       4.0   160.0
6     july   50.0       2.0    0.0     100.0   30.0       4.0   220.0
7   aguage   90.0       2.0    5.0     100.0   40.0       4.0   840.0
8      sem   90.0       2.0    5.0     100.0   40.0       4.0    10.0
9      oct   10.0       2.0    0.0     100.0    1.0       4.0    24.0
10     nov   40.0       2.0    2.0     100.0   10.0       4.0   240.0
11     dec   20.0       2.0    0.0     100.0    2.0       4.0   100.0
12    njan   20.0       2.0    0.0     100.0    2.0       4.0   500.0
13    nfeb   20.0       2.0    0.0     100.0    2.0       4.0   380.0
14  nmarch   20.0       2.0    0.0     100.0    2.0       4.0   100.0
15  napiri   20.0       2.0    0.0     100.0    2.0       4.0   100.0
16    nmay   50.0       2.0    0.0     100.0   30.0       4.0   220.0